a = int(input("Введіть сторону а: "))
b = int(input("Введіть сторону b: "))
c = int(input("Введіть сторону с: "))

if a + b <= c or b + c <= a or a + c <= b :
  print("Трикутника не існує")
else:
  if a*a + b*b == c*c :
    print("кут С - прямий, кут A - гострий, кут B - гострий")
  elif b*b + c*c == a*a :
    print("кут A - прямий, кут B - гострий, кут C - гострий")
  elif a*a + c*c == b*b :
    print("кут B - прямий, кут A - гострий, кут C - гострий")
  elif (a*a + b*b) < c*c :
    print("кут С - тупий, кут A - гострий, кут B - гострий")
  elif (b*b + c*c) < a*a :
    print("кут A - тупий, кут B - гострий, кут C - гострий")
  elif (a*a + c*c) < b*b :
    print("кут B - тупий, кут A - гострий, кут C - гострий")
  else:
    print("кут A - гострий, кут B - гострий, кут C - гострий")

